app/Models/CategoriaModel.php

SELECT *
FROM `categoria`
---
    public function getDados($id = null)
    {
        if ($id == null) {
            return $this->findAll();